"espk" = "Apple Lautsprecher-Anschluss";
"ispk" = "Integriert";
"emic" = "Mikrofon-Anschluss";
"imic" = "Integriert";
"hdpn" = "Kopfhörer-Anschluss";
"lini" = "Audio Line-In-Anschluss";
"lino" = "Audio Line-Out-Anschluss";
"spdi" = "Optischer digitaler Eingang";
"spdo" = "Optischer digitaler Ausgang";
"pci " = "PCI-Karte";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Netzwerkgerät";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-Kopfhörer";
"blus" = "Bluetooth-Headset";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
